testing-scripts/test_multi-client_encrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/10/result.txt
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 133.99ms, 74.63 req/s, 71.20MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 598 sent, 8243 received
                     min         max         mean         sd        +/- sd
time for request:   106.61ms    121.71ms    113.30ms      5.73ms    70.00%
time for connect:     4.16ms     25.47ms     14.65ms      7.16ms    60.00%
time to 1st byte:    25.24ms     29.14ms     27.13ms      1.41ms    60.00%
req/s           :       7.48        8.01        7.80        0.18    70.00%